Autodesk.Revit.DB.NumberSystemJustifyOption
The available options for justification of the numbers in a number system.
Since:
2013

Autodesk.Revit.DB.NumberSystemJustifyOption.Back
The number will locate in back of the annotated object along the annotating direction.

Autodesk.Revit.DB.NumberSystemJustifyOption.Center
The number will locate in the center of the annotated object along the annotating direction.

Autodesk.Revit.DB.NumberSystemJustifyOption.Front
The number will locate in front of the annotated object along the annotating direction.